**SUBMITTED BY:-**

**NAME:-** TANISHA BANSAL

**BRANCH:-** CSE-AI-2

**ROLL NO:-** 14301172022

**SUBMISSION DATE:-** 25th August 2024

**COURSE:-** DEEP LEARNING ASSIGNMENT - 2

**AIM:** Write a program using Pandas library to create and display data frames from a
CSV and explore the functionalities of dataframes.

**(i) Loading and Printing first ten rows of dataset**

In [13]:
import pandas as pd

# Loading the dataset
data = pd.read_csv('Automobile_data.csv')

# Printing the first ten rows
print(data.head(10))

   index      company   body-style  wheel-base  length engine-type  \
0      0  alfa-romero  convertible        88.6   168.8        dohc
1      1  alfa-romero  convertible        88.6   168.8        dohc
2      2  alfa-romero    hatchback        94.5   171.2        ohcv
3      3         audi        sedan        99.8   176.6         ohc
4      4         audi        sedan        99.4   176.6         ohc
5      5         audi        sedan        99.8   177.3         ohc
6      6         audi        wagon       105.8   192.7         ohc
7      9          bmw        sedan       101.2   176.8         ohc
8     10          bmw        sedan       101.2   176.8         ohc
9     11          bmw        sedan       101.2   176.8         ohc

  num-of-cylinders  horsepower  average-mileage    price
0             four         111               21  13495.0
1             four         111               21  16500.0
2              six         154               19  16500.0
3             four         102               24  13950.0
4             five         115               18  17450.0
5             five         110               19  15250.0
6             five         110               19  18920.0
7             four         101               23  16430.0
8             four         101               23  16925.0
9              six         121               21  20970.0

**(ii) Dropping a column**

In [14]:
# Dropping the 'length' column
dropped_data = data.drop(columns=['length'])

# Printing the dataframe after dropping the column
print(dropped_data.head())

   index      company   body-style  wheel-base engine-type num-of-cylinders  \
0      0  alfa-romero  convertible        88.6        dohc             four
1      1  alfa-romero  convertible        88.6        dohc             four
2      2  alfa-romero    hatchback        94.5        ohcv              six
3      3         audi        sedan        99.8         ohc             four
4      4         audi        sedan        99.4         ohc             five

   horsepower  average-mileage    price
0         111               21  13495.0
1         111               21  16500.0
2         154               19  16500.0
3         102               24  13950.0
4         115               18  17450.0

**(iii) Printing last five rows**

In [15]:
# Printing the last five rows
print(data.tail(5))

    index     company body-style  wheel-base  length engine-type  \
56     81  volkswagen      sedan        97.3   171.7         ohc
57     82  volkswagen      sedan        97.3   171.7         ohc
58     86  volkswagen      sedan        97.3   171.7         ohc
59     87       volvo      sedan       104.3   188.8         ohc
60     88       volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

**(iv) Print All Toyota Cars details**

In [16]:
# Printing all rows where the company is 'Toyota'
toyota_cars = data[data['company'] == 'Toyota']
print(toyota_cars)

Empty DataFrame
Columns: [index, company, body-style, wheel-base, length, engine-type, num-of-cylinders, horsepower, average-mileage, price]
Index: []

**(v) Count total cars per company**

In [17]:
# Counting total cars per company
counts_of_cars = data['company'].value_counts()
print(counts_of_cars)

company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: count, dtype: int64

**(vi) Find each company’s Highest price car**

In [18]:
# Finding each company’s highest price car
highest_price_car = data.groupby('company')['price'].max()
print(highest_price_car)

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

**(vii) Getting average mileage of car**

In [19]:
# Calculating average mileage of all cars
average_mileage = data['average-mileage'].mean()
print(f"Average mileage of all cars: {average_mileage}")

Average mileage of all cars: 25.80327868852459

**(viii) Sort all cars by Price column**

In [20]:
# Sorting all cars by the 'price' column
sorting_cars = data.sort_values(by='price', ascending=True)
print(sorting_cars)

    index        company body-style  wheel-base  length engine-type  \
13     16      chevrolet  hatchback        88.4   141.1           l
27     36          mazda  hatchback        93.1   159.1         ohc
48     66         toyota  hatchback        95.7   158.7         ohc
36     49     mitsubishi  hatchback        93.7   157.3         ohc
28     37          mazda  hatchback        93.1   159.1         ohc
..    ...            ...        ...         ...     ...         ...
11     14            bmw      sedan       103.5   193.8         ohc
35     47  mercedes-benz    hardtop       112.0   199.2        ohcv
22     31          isuzu      sedan        94.5   155.9         ohc
23     32          isuzu      sedan        94.5   155.9         ohc
47     63        porsche  hatchback        98.4   175.7       dohcv

   num-of-cylinders  horsepower  average-mileage    price
13            three          48               47   5151.0
27             four          68               30   5195.0
48             four          62               35   5348.0
36             four          68               37   5389.0
28             four          68               31   6095.0
..              ...         ...              ...      ...
11              six         182               16  41315.0
35            eight         184               14  45400.0
22             four          70               38      NaN
23             four          70               38      NaN
47            eight         288               17      NaN

[61 rows x 10 columns]